zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba25xx.h
/*******************  Bit definition for USART_ICR register  ******************/
#define USART_ICR_PECF_Pos                  (0UL)
#define USART_ICR_PECF_Msk                  (0x1UL << USART_ICR_PECF_Pos)           /*!< 0x00000001 */
#define USART_ICR_PECF                      USART_ICR_PECF_Msk                      /*!< Parity Error Clear Flag */
#define USART_ICR_FECF_Pos                  (1UL)
#define USART_ICR_FECF_Msk                  (0x1UL << USART_ICR_FECF_Pos)           /*!< 0x00000002 */
#define USART_ICR_FECF                      USART_ICR_FECF_Msk                      /*!< Framing Error Clear Flag */
#define USART_ICR_NECF_Pos                  (2UL)
#define USART_ICR_NECF_Msk                  (0x1UL << USART_ICR_NECF_Pos)           /*!< 0x00000004 */
#define USART_ICR_NECF                      USART_ICR_NECF_Msk                      /*!< Noise detected Clear Flag */
#define USART_ICR_ORECF_Pos                 (3UL)
#define USART_ICR_ORECF_Msk                 (0x1UL << USART_ICR_ORECF_Pos)          /*!< 0x00000008 */
#define USART_ICR_ORECF                     USART_ICR_ORECF_Msk                     /*!< OverRun Error Clear Flag */
#define USART_ICR_IDLECF_Pos                (4UL)
#define USART_ICR_IDLECF_Msk                (0x1UL << USART_ICR_IDLECF_Pos)         /*!< 0x00000010 */
#define USART_ICR_IDLECF                    USART_ICR_IDLECF_Msk                    /*!< IDLE line detected Clear Flag */
#define USART_ICR_TXFECF_Pos                (5UL)
#define USART_ICR_TXFECF_Msk                (0x1UL << USART_ICR_TXFECF_Pos)         /*!< 0x00000020 */
#define USART_ICR_TXFECF                    USART_ICR_TXFECF_Msk                    /*!< TXFIFO empty Clear flag */
#define USART_ICR_TCCF_Pos                  (6UL)
#define USART_ICR_TCCF_Msk                  (0x1UL << USART_ICR_TCCF_Pos)           /*!< 0x00000040 */
#define USART_ICR_TCCF                      USART_ICR_TCCF_Msk                      /*!< Transmission Complete Clear Flag */
#define USART_ICR_TCBGTCF_Pos               (7UL)
#define USART_ICR_TCBGTCF_Msk               (0x1UL << USART_ICR_TCBGTCF_Pos)        /*!< 0x00000080 */
#define USART_ICR_TCBGTCF                   USART_ICR_TCBGTCF_Msk                   /*!< Transmission Complete Before Guard Time Clear Flag */
#define USART_ICR_LBDCF_Pos                 (8UL)
#define USART_ICR_LBDCF_Msk                 (0x1UL << USART_ICR_LBDCF_Pos)          /*!< 0x00000100 */
#define USART_ICR_LBDCF                     USART_ICR_LBDCF_Msk                     /*!< LIN Break Detection Clear Flag */
#define USART_ICR_CTSCF_Pos                 (9UL)
#define USART_ICR_CTSCF_Msk                 (0x1UL << USART_ICR_CTSCF_Pos)          /*!< 0x00000200 */
#define USART_ICR_CTSCF                     USART_ICR_CTSCF_Msk                     /*!< CTS Interrupt Clear Flag */
#define USART_ICR_RTOCF_Pos                 (11UL)
#define USART_ICR_RTOCF_Msk                 (0x1UL << USART_ICR_RTOCF_Pos)          /*!< 0x00000800 */
#define USART_ICR_RTOCF                     USART_ICR_RTOCF_Msk                     /*!< Receiver Time Out Clear Flag */
#define USART_ICR_EOBCF_Pos                 (12UL)
#define USART_ICR_EOBCF_Msk                 (0x1UL << USART_ICR_EOBCF_Pos)          /*!< 0x00001000 */
#define USART_ICR_EOBCF                     USART_ICR_EOBCF_Msk                     /*!< End Of Block Clear Flag */
#define USART_ICR_UDRCF_Pos                 (13UL)
#define USART_ICR_UDRCF_Msk                 (0x1UL << USART_ICR_UDRCF_Pos)          /*!< 0x00002000 */
#define USART_ICR_UDRCF                     USART_ICR_UDRCF_Msk                     /*!< SPI Slave Underrun Clear Flag */
#define USART_ICR_CMCF_Pos                  (17UL)
#define USART_ICR_CMCF_Msk                  (0x1UL << USART_ICR_CMCF_Pos)           /*!< 0x00020000 */
#define USART_ICR_CMCF                      USART_ICR_CMCF_Msk                      /*!< Character Match Clear Flag */

/*******************  Bit definition for USART_RDR register  ******************/
#define USART_RDR_RDR                       ((uint16_t)0x01FF)                      /*!< RDR[8:0] bits (Receive Data value) */

/*******************  Bit definition for USART_TDR register  ******************/
#define USART_TDR_TDR                       ((uint16_t)0x01FF)                      /*!< TDR[8:0] bits (Transmit Data value) */

/*******************  Bit definition for USART_PRESC register  ****************/
#define USART_PRESC_PRESCALER_Pos           (0UL)
#define USART_PRESC_PRESCALER_Msk           (0xFUL << USART_PRESC_PRESCALER_Pos)    /*!< 0x0000000F */
#define USART_PRESC_PRESCALER               USART_PRESC_PRESCALER_Msk               /*!< PRESCALER[3:0] bits (Clock prescaler) */
#define USART_PRESC_PRESCALER_0             (0x1UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000001 */
#define USART_PRESC_PRESCALER_1             (0x2UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000002 */
#define USART_PRESC_PRESCALER_2             (0x4UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000004 */
#define USART_PRESC_PRESCALER_3             (0x8UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000008 */

/*******************  Bit definition for USART_AUTOCR register  ******************/
#define USART_AUTOCR_TDN_Pos                (0UL)
#define USART_AUTOCR_TDN_Msk                (0xFFFFUL << USART_AUTOCR_TDN_Pos)      /*!< 0x0000FFFF */
#define USART_AUTOCR_TDN                    USART_AUTOCR_TDN_Msk                    /*!< TDN[15:0] bits (Transmission Data Number) */
#define USART_AUTOCR_TRIGPOL_Pos            (16UL)
#define USART_AUTOCR_TRIGPOL_Msk            (0x1UL << USART_AUTOCR_TRIGPOL_Pos)     /*!< 0x00010000 */
#define USART_AUTOCR_TRIGPOL                USART_AUTOCR_TRIGPOL_Msk                /*!< Trigger Polarity Bit (Rising/Falling edge) */
#define USART_AUTOCR_TRIGEN_Pos             (17UL)
#define USART_AUTOCR_TRIGEN_Msk             (0x1UL << USART_AUTOCR_TRIGEN_Pos)      /*!< 0x00020000 */
#define USART_AUTOCR_TRIGEN                 USART_AUTOCR_TRIGEN_Msk                 /*!< Trigger Enable Bit */
#define USART_AUTOCR_IDLEDIS_Pos            (18UL)
#define USART_AUTOCR_IDLEDIS_Msk            (0x1UL << USART_AUTOCR_IDLEDIS_Pos)     /*!< 0x00040000 */
#define USART_AUTOCR_IDLEDIS                USART_AUTOCR_IDLEDIS_Msk                /*!< Idle Frame Transmission Disable Bit*/
#define USART_AUTOCR_TRIGSEL_Pos            (19UL)
#define USART_AUTOCR_TRIGSEL_Msk            (0xFUL << USART_AUTOCR_TRIGSEL_Pos)     /*!< 0x00780000 */
#define USART_AUTOCR_TRIGSEL                USART_AUTOCR_TRIGSEL_Msk                /*!< Trigger Selection Bits */
#define USART_AUTOCR_TRIGSEL_0              (0x0001UL << USART_AUTOCR_TRIGSEL_Pos)  /*!< 0x00000001 */
#define USART_AUTOCR_TRIGSEL_1              (0x0002UL << USART_AUTOCR_TRIGSEL_Pos)  /*!< 0x00000002 */
#define USART_AUTOCR_TRIGSEL_2              (0x0004UL << USART_AUTOCR_TRIGSEL_Pos)  /*!< 0x00000004 */
#define USART_AUTOCR_TRIGSEL_3              (0x0008UL << USART_AUTOCR_TRIGSEL_Pos)  /*!< 0x00000008 */


/******************************************************************************/
/*                                                                            */
/*                        USB address block description*/
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for USB_CHEPnR registers  ********************/
#define USB_CHEP_EA_Pos           (0UL)
#define USB_CHEP_EA_Msk           (0xFUL << USB_CHEP_EA_Pos)           /*!< 0x0000000F */
#define USB_CHEP_EA               USB_CHEP_EA_Msk                      /*!< EA[3:0] bits (endpoint/channel address) */
#define USB_CHEP_EA_0             (0x01UL << USB_CHEP_EA_Pos)          /*!< 0x00000001 */
#define USB_CHEP_EA_1             (0x02UL << USB_CHEP_EA_Pos)          /*!< 0x00000002 */
#define USB_CHEP_EA_2             (0x04UL << USB_CHEP_EA_Pos)          /*!< 0x00000004 */
#define USB_CHEP_EA_3             (0x08UL << USB_CHEP_EA_Pos)          /*!< 0x00000008 */
#define USB_CHEP_STATTX_Pos       (4UL)
#define USB_CHEP_STATTX_Msk       (0x3UL << USB_CHEP_STATTX_Pos)       /*!< 0x00000030 */
#define USB_CHEP_STATTX           USB_CHEP_STATTX_Msk                  /*!< STATTX[1:0] bits (Status bits, for transmission transfers) */
#define USB_CHEP_STATTX_0         (0x1UL << USB_CHEP_STATTX_Pos)       /*!< 0x00000010 */
#define USB_CHEP_STATTX_1         (0x2UL << USB_CHEP_STATTX_Pos)       /*!< 0x00000020 */
#define USB_CHEP_DTOGTX_Pos       (6UL)
#define USB_CHEP_DTOGTX_Msk       (0x1UL << USB_CHEP_DTOGTX_Pos)       /*!< 0x00000040 */
#define USB_CHEP_DTOGTX           USB_CHEP_DTOGTX_Msk                  /*!< DTOGTX (Data toggle, for transmission transfers) */
#define USB_CHEP_VTTX_Pos         (7UL)
#define USB_CHEP_VTTX_Msk         (0x1UL << USB_CHEP_VTTX_Pos)         /*!< 0x00000080 */
#define USB_CHEP_VTTX             USB_CHEP_VTTX_Msk                    /*!< VTTX (Valid USB transaction transmitted) */
#define USB_CHEP_EPKIND_Pos       (8UL)
#define USB_CHEP_EPKIND_Msk       (0x1UL << USB_CHEP_EPKIND_Pos)       /*!< 0x00000100 */
#define USB_CHEP_EPKIND           USB_CHEP_EPKIND_Msk                  /*!< EPKIND (endpoint/channel kind) */
#define USB_CHEP_UTYPE_Pos        (9UL)
#define USB_CHEP_UTYPE_Msk        (0x3UL << USB_CHEP_UTYPE_Pos)        /*!< 0x00000600 */
#define USB_CHEP_UTYPE            USB_CHEP_UTYPE_Msk                   /*!< UTYPE[1:0] bits (USB type of transaction) */
#define USB_CHEP_UTYPE_0          (0x1UL << USB_CHEP_UTYPE_Pos)        /*!< 0x00000200 */
#define USB_CHEP_UTYPE_1          (0x2UL << USB_CHEP_UTYPE_Pos)        /*!< 0x00000400 */
#define USB_CHEP_SETUP_Pos        (11UL)
#define USB_CHEP_SETUP_Msk        (0x1UL << USB_CHEP_SETUP_Pos)        /*!< 0x00000800 */
#define USB_CHEP_SETUP            USB_CHEP_SETUP_Msk                   /*!< SETUP (Setup transaction completed) */
#define USB_CHEP_STATRX_Pos       (12UL)
#define USB_CHEP_STATRX_Msk       (0x3UL << USB_CHEP_STATRX_Pos)       /*!< 0x00003000 */
#define USB_CHEP_STATRX           USB_CHEP_STATRX_Msk                  /*!< STATRX[1:0] bits (Status bits, for reception transfers) */
#define USB_CHEP_STATRX_0         (0x1UL << USB_CHEP_STATRX_Pos)       /*!< 0x00001000 */
#define USB_CHEP_STATRX_1         (0x2UL << USB_CHEP_STATRX_Pos)       /*!< 0x00002000 */
#define USB_CHEP_DTOGRX_Pos       (14UL)
#define USB_CHEP_DTOGRX_Msk       (0x1UL << USB_CHEP_DTOGRX_Pos)       /*!< 0x00004000 */
#define USB_CHEP_DTOGRX           USB_CHEP_DTOGRX_Msk                  /*!< DTOGRX (Data Toggle, for reception transfers) */
#define USB_CHEP_VTRX_Pos         (15UL)
#define USB_CHEP_VTRX_Msk         (0x1UL << USB_CHEP_VTRX_Pos)         /*!< 0x00008000 */
#define USB_CHEP_VTRX             USB_CHEP_VTRX_Msk                    /*!< VTRX (USB valid transaction received) */
#define USB_CHEP_DEVADDR_Pos      (16UL)
#define USB_CHEP_DEVADDR_Msk      (0x7FUL << USB_CHEP_DEVADDR_Pos)     /*!< 0x007F0000 */
#define USB_CHEP_DEVADDR          USB_CHEP_DEVADDR_Msk                 /*!< DEVADDR[6:0] bits (Host mode) */
#define USB_CHEP_DEVADDR_0        (0x01UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00010000 */
#define USB_CHEP_DEVADDR_1        (0x02UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00020000 */
#define USB_CHEP_DEVADDR_2        (0x04UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00040000 */
#define USB_CHEP_DEVADDR_3        (0x08UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00080000 */
#define USB_CHEP_DEVADDR_4        (0x10UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00100000 */
#define USB_CHEP_DEVADDR_5        (0x20UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00200000 */
#define USB_CHEP_DEVADDR_6        (0x40UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00400000 */
#define USB_CHEP_NAK_Pos          (23UL)
#define USB_CHEP_NAK_Msk          (0x1UL << USB_CHEP_NAK_Pos)          /*!< 0x00800000 */
#define USB_CHEP_NAK              USB_CHEP_NAK_Msk                     /*!< NAK (Host mode) */
#define USB_CHEP_LS_EP_Pos        (24UL)
#define USB_CHEP_LS_EP_Msk        (0x1UL << USB_CHEP_LS_EP_Pos)        /*!< 0x01000000 */
#define USB_CHEP_LS_EP            USB_CHEP_LS_EP_Msk                   /*!< LS_EP (Low speed endpoint and host with HUB only) */
#define USB_CHEP_ERR_TX_Pos       (25UL)
#define USB_CHEP_ERR_TX_Msk       (0x1UL << USB_CHEP_ERR_TX_Pos)       /*!< 0x02000000 */
#define USB_CHEP_ERR_TX           USB_CHEP_ERR_TX_Msk                  /*!< ERR_TX (Received error for an OUT/SETUP transaction) */
#define USB_CHEP_ERR_RX_Pos       (26UL)
#define USB_CHEP_ERR_RX_Msk       (0x1UL << USB_CHEP_ERR_RX_Pos)       /*!< 0x04000000 */
#define USB_CHEP_ERR_RX           USB_CHEP_ERR_RX_Msk                  /*!< ERR_RX (Received error for an IN transaction) */
#define USB_CHEP_THREE_ERR_TX_Pos (27UL)
#define USB_CHEP_THREE_ERR_TX_Msk (0x3UL << USB_CHEP_THREE_ERR_TX_Pos) /*!< 0x18000000 */
#define USB_CHEP_THREE_ERR_TX     USB_CHEP_THREE_ERR_TX_Msk            /*!< THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction) */
#define USB_CHEP_THREE_ERR_TX_0   (0x1UL << USB_CHEP_THREE_ERR_TX_Pos) /*!< 0x08000000 */
#define USB_CHEP_THREE_ERR_TX_1   (0x2UL << USB_CHEP_THREE_ERR_TX_Pos) /*!< 0x10000000 */
#define USB_CHEP_THREE_ERR_RX_Pos (29UL)
#define USB_CHEP_THREE_ERR_RX_Msk (0x3UL << USB_CHEP_THREE_ERR_RX_Pos) /*!< 0x60000000 */
#define USB_CHEP_THREE_ERR_RX     USB_CHEP_THREE_ERR_RX_Msk            /*!< THREE_ERR_RX[1:0] bits (Three errors for an IN transaction) */
#define USB_CHEP_THREE_ERR_RX_0   (0x1UL << USB_CHEP_THREE_ERR_RX_Pos) /*!< 0x20000000 */
#define USB_CHEP_THREE_ERR_RX_1   (0x2UL << USB_CHEP_THREE_ERR_RX_Pos) /*!< 0x40000000 */

/********************  Bit definition for USB_CNTR register  ********************/
#define USB_CNTR_USBRST_Pos    (0UL)
#define USB_CNTR_USBRST_Msk    (0x1UL << USB_CNTR_USBRST_Pos)    /*!< 0x00000001 */
#define USB_CNTR_USBRST        USB_CNTR_USBRST_Msk               /*!< USBRST (USB Reset) */
#define USB_CNTR_PDWN_Pos      (1UL)
#define USB_CNTR_PDWN_Msk      (0x1UL << USB_CNTR_PDWN_Pos)      /*!< 0x00000002 */
#define USB_CNTR_PDWN          USB_CNTR_PDWN_Msk                 /*!< PDWN (Power down) */
#define USB_CNTR_SUSPRDY_Pos   (2UL)
#define USB_CNTR_SUSPRDY_Msk   (0x1UL << USB_CNTR_SUSPRDY_Pos)   /*!< 0x00000004 */
#define USB_CNTR_SUSPRDY       USB_CNTR_SUSPRDY_Msk              /*!< SUSPRDY (Suspend state effective) */
#define USB_CNTR_SUSPEN_Pos    (3UL)
#define USB_CNTR_SUSPEN_Msk    (0x1UL << USB_CNTR_SUSPEN_Pos)    /*!< 0x00000008 */
#define USB_CNTR_SUSPEN        USB_CNTR_SUSPEN_Msk               /*!< SUSPEN (Suspend state enable) */
#define USB_CNTR_L2RES_Pos     (4UL)
#define USB_CNTR_L2RES_Msk     (0x1UL << USB_CNTR_L2RES_Pos)     /*!< 0x00000010 */
#define USB_CNTR_L2RES         USB_CNTR_L2RES_Msk                /*!< L2RES (L2 remote wake-up / resume driver) */
#define USB_CNTR_L1RES_Pos     (5UL)
#define USB_CNTR_L1RES_Msk     (0x1UL << USB_CNTR_L1RES_Pos)     /*!< 0x00000020 */
#define USB_CNTR_L1RES         USB_CNTR_L1RES_Msk                /*!< L1RES (L1 remote wake-up / resume driver) */
#define USB_CNTR_L1REQM_Pos    (7UL)
#define USB_CNTR_L1REQM_Msk    (0x1UL << USB_CNTR_L1REQM_Pos)    /*!< 0x00000080 */
#define USB_CNTR_L1REQM        USB_CNTR_L1REQM_Msk               /*!< L1REQM (LPM L1 state request interrupt mask) */
#define USB_CNTR_ESOFM_Pos     (8UL)
#define USB_CNTR_ESOFM_Msk     (0x1UL << USB_CNTR_ESOFM_Pos)     /*!< 0x00000100 */
#define USB_CNTR_ESOFM         USB_CNTR_ESOFM_Msk                /*!< ESOFM (Expected start of frame interrupt mask) */
#define USB_CNTR_SOFM_Pos      (9UL)
#define USB_CNTR_SOFM_Msk      (0x1UL << USB_CNTR_SOFM_Pos)      /*!< 0x00000200 */
#define USB_CNTR_SOFM          USB_CNTR_SOFM_Msk                 /*!< SOFM (Start of frame interrupt mask) */
#define USB_CNTR_RST_DCONM_Pos (10UL)
#define USB_CNTR_RST_DCONM_Msk (0x1UL << USB_CNTR_RST_DCONM_Pos) /*!< 0x00000400 */
#define USB_CNTR_RST_DCONM     USB_CNTR_RST_DCONM_Msk            /*!< RST_DCONM (USB reset request (Device mode) or device connect/disconnect (Host mode) interrupt mask) */
#define USB_CNTR_SUSPM_Pos     (11UL)
#define USB_CNTR_SUSPM_Msk     (0x1UL << USB_CNTR_SUSPM_Pos)     /*!< 0x00000800 */
#define USB_CNTR_SUSPM         USB_CNTR_SUSPM_Msk                /*!< SUSPM (Suspend mode interrupt mask) */
#define USB_CNTR_WKUPM_Pos     (12UL)
#define USB_CNTR_WKUPM_Msk     (0x1UL << USB_CNTR_WKUPM_Pos)     /*!< 0x00001000 */
#define USB_CNTR_WKUPM         USB_CNTR_WKUPM_Msk                /*!< WKUPM (Wake-up interrupt mask) */
#define USB_CNTR_ERRM_Pos      (13UL)
#define USB_CNTR_ERRM_Msk      (0x1UL << USB_CNTR_ERRM_Pos)      /*!< 0x00002000 */
#define USB_CNTR_ERRM          USB_CNTR_ERRM_Msk                 /*!< ERRM (Error interrupt mask) */
#define USB_CNTR_PMAOVRM_Pos   (14UL)
#define USB_CNTR_PMAOVRM_Msk   (0x1UL << USB_CNTR_PMAOVRM_Pos)   /*!< 0x00004000 */
#define USB_CNTR_PMAOVRM       USB_CNTR_PMAOVRM_Msk              /*!< PMAOVRM (Packet memory area over / underrun interrupt mask) */
#define USB_CNTR_CTRM_Pos      (15UL)
#define USB_CNTR_CTRM_Msk      (0x1UL << USB_CNTR_CTRM_Pos)      /*!< 0x00008000 */
#define USB_CNTR_CTRM          USB_CNTR_CTRM_Msk                 /*!< CTRM (Correct transfer interrupt mask) */
#define USB_CNTR_THR512M_Pos   (16UL)
#define USB_CNTR_THR512M_Msk   (0x1UL << USB_CNTR_THR512M_Pos)   /*!< 0x00010000 */
#define USB_CNTR_THR512M       USB_CNTR_THR512M_Msk              /*!< THR512M (512 byte threshold interrupt mask) */
#define USB_CNTR_DDISCM_Pos    (17UL)
#define USB_CNTR_DDISCM_Msk    (0x1UL << USB_CNTR_DDISCM_Pos)    /*!< 0x00020000 */
#define USB_CNTR_DDISCM        USB_CNTR_DDISCM_Msk               /*!< DDISCM (Device disconnection mask) */
#define USB_CNTR_HOST_Pos      (31UL)
#define USB_CNTR_HOST_Msk      (0x1UL << USB_CNTR_HOST_Pos)      /*!< 0x80000000 */
#define USB_CNTR_HOST          USB_CNTR_HOST_Msk                 /*!< HOST (HOST mode) */

/********************  Bit definition for USB_ISTR register  ********************/
#define USB_ISTR_IDN_Pos       (0UL)
#define USB_ISTR_IDN_Msk       (0xFUL << USB_ISTR_IDN_Pos)       /*!< 0x0000000F */
#define USB_ISTR_IDN           USB_ISTR_IDN_Msk                  /*!< IDN[3:0] bits (Device Endpoint / host channel identification number) */
#define USB_ISTR_IDN_0         (0x01UL << USB_ISTR_IDN_Pos)      /*!< 0x00000001 */
#define USB_ISTR_IDN_1         (0x02UL << USB_ISTR_IDN_Pos)      /*!< 0x00000002 */
#define USB_ISTR_IDN_2         (0x04UL << USB_ISTR_IDN_Pos)      /*!< 0x00000004 */
#define USB_ISTR_IDN_3         (0x08UL << USB_ISTR_IDN_Pos)      /*!< 0x00000008 */
#define USB_ISTR_DIR_Pos       (4UL)
#define USB_ISTR_DIR_Msk       (0x1UL << USB_ISTR_DIR_Pos)       /*!< 0x00000010 */
#define USB_ISTR_DIR           USB_ISTR_DIR_Msk                  /*!< DIR (Direction of transaction) */
#define USB_ISTR_L1REQ_Pos     (7UL)
#define USB_ISTR_L1REQ_Msk     (0x1UL << USB_ISTR_L1REQ_Pos)     /*!< 0x00000080 */
#define USB_ISTR_L1REQ         USB_ISTR_L1REQ_Msk                /*!< L1REQ (LPM L1 state request) */
#define USB_ISTR_ESOF_Pos      (8UL)
#define USB_ISTR_ESOF_Msk      (0x1UL << USB_ISTR_ESOF_Pos)      /*!< 0x00000100 */
#define USB_ISTR_ESOF          USB_ISTR_ESOF_Msk                 /*!< ESOF (Expected start of frame) */
#define USB_ISTR_SOF_Pos       (9UL)
#define USB_ISTR_SOF_Msk       (0x1UL << USB_ISTR_SOF_Pos)       /*!< 0x00000200 */
#define USB_ISTR_SOF           USB_ISTR_SOF_Msk                  /*!< SOF (Start of frame) */
#define USB_ISTR_RST_DCON_Pos  (10UL)
#define USB_ISTR_RST_DCON_Msk  (0x1UL << USB_ISTR_RST_DCON_Pos)  /*!< 0x00000400 */
#define USB_ISTR_RST_DCON      USB_ISTR_RST_DCON_Msk             /*!< RST_DCON (USB reset request (Device mode) or device connect/disconnect (Host mode)) */
#define USB_ISTR_SUSP_Pos      (11UL)
#define USB_ISTR_SUSP_Msk      (0x1UL << USB_ISTR_SUSP_Pos)      /*!< 0x00000800 */
#define USB_ISTR_SUSP          USB_ISTR_SUSP_Msk                 /*!< SUSP (Suspend mode request) */
#define USB_ISTR_WKUP_Pos      (12UL)
#define USB_ISTR_WKUP_Msk      (0x1UL << USB_ISTR_WKUP_Pos)      /*!< 0x00001000 */
#define USB_ISTR_WKUP          USB_ISTR_WKUP_Msk                 /*!< WKUP (Wake-up) */
#define USB_ISTR_ERR_Pos       (13UL)
#define USB_ISTR_ERR_Msk       (0x1UL << USB_ISTR_ERR_Pos)       /*!< 0x00002000 */
#define USB_ISTR_ERR           USB_ISTR_ERR_Msk                  /*!< ERR (Error) */
#define USB_ISTR_PMAOVR_Pos    (14UL)
#define USB_ISTR_PMAOVR_Msk    (0x1UL << USB_ISTR_PMAOVR_Pos)    /*!< 0x00004000 */
#define USB_ISTR_PMAOVR        USB_ISTR_PMAOVR_Msk               /*!< PMAOVR (Packet memory area over / underrun) */
#define USB_ISTR_CTR_Pos       (15UL)
#define USB_ISTR_CTR_Msk       (0x1UL << USB_ISTR_CTR_Pos)       /*!< 0x00008000 */
#define USB_ISTR_CTR           USB_ISTR_CTR_Msk                  /*!< CTR (Completed transfer in host mode) */
#define USB_ISTR_THR512_Pos    (16UL)
#define USB_ISTR_THR512_Msk    (0x1UL << USB_ISTR_THR512_Pos)    /*!< 0x00010000 */
#define USB_ISTR_THR512        USB_ISTR_THR512_Msk               /*!< THR512 (512 byte threshold interrupt) */
#define USB_ISTR_DDISC_Pos     (17UL)
#define USB_ISTR_DDISC_Msk     (0x1UL << USB_ISTR_DDISC_Pos)     /*!< 0x00020000 */
#define USB_ISTR_DDISC         USB_ISTR_DDISC_Msk                /*!< DDISC (Device connection) */
#define USB_ISTR_DCON_STAT_Pos (29UL)
#define USB_ISTR_DCON_STAT_Msk (0x1UL << USB_ISTR_DCON_STAT_Pos) /*!< 0x20000000 */
#define USB_ISTR_DCON_STAT     USB_ISTR_DCON_STAT_Msk            /*!< DCON_STAT (Device connection status) */
#define USB_ISTR_LS_DCON_Pos   (30UL)
#define USB_ISTR_LS_DCON_Msk   (0x1UL << USB_ISTR_LS_DCON_Pos)   /*!< 0x40000000 */
#define USB_ISTR_LS_DCON       USB_ISTR_LS_DCON_Msk              /*!< LS_DCON (Low speed device connected) */

/********************  Bit definition for USB_FNR register  ********************/
#define USB_FNR_FN_Pos   (0UL)
#define USB_FNR_FN_Msk   (0x7FFUL << USB_FNR_FN_Pos) /*!< 0x000007FF */
#define USB_FNR_FN       USB_FNR_FN_Msk              /*!< FN[10:0] bits (Frame number) */
#define USB_FNR_LSOF_Pos (11UL)
#define USB_FNR_LSOF_Msk (0x3UL << USB_FNR_LSOF_Pos) /*!< 0x00001800 */
#define USB_FNR_LSOF     USB_FNR_LSOF_Msk            /*!< LSOF[1:0] bits (Lost SOF) */
#define USB_FNR_LSOF_0   (0x1UL << USB_FNR_LSOF_Pos) /*!< 0x00000800 */
#define USB_FNR_LSOF_1   (0x2UL << USB_FNR_LSOF_Pos) /*!< 0x00001000 */
#define USB_FNR_LCK_Pos  (13UL)
#define USB_FNR_LCK_Msk  (0x1UL << USB_FNR_LCK_Pos)  /*!< 0x00002000 */
#define USB_FNR_LCK      USB_FNR_LCK_Msk             /*!< LCK (Locked) */
#define USB_FNR_RXDM_Pos (14UL)
#define USB_FNR_RXDM_Msk (0x1UL << USB_FNR_RXDM_Pos) /*!< 0x00004000 */
#define USB_FNR_RXDM     USB_FNR_RXDM_Msk            /*!< RXDM (Receive data - line status) */
#define USB_FNR_RXDP_Pos (15UL)
#define USB_FNR_RXDP_Msk (0x1UL << USB_FNR_RXDP_Pos) /*!< 0x00008000 */
#define USB_FNR_RXDP     USB_FNR_RXDP_Msk            /*!< RXDP (Receive data + line status) */

/********************  Bit definition for USB_DADDR register  ********************/
#define USB_DADDR_ADD_Pos (0UL)
#define USB_DADDR_ADD_Msk (0x7FUL << USB_DADDR_ADD_Pos) /*!< 0x0000007F */
#define USB_DADDR_ADD     USB_DADDR_ADD_Msk             /*!< ADD[6:0] bits (Device address) */
#define USB_DADDR_EF_Pos  (7UL)
#define USB_DADDR_EF_Msk  (0x1UL << USB_DADDR_EF_Pos)   /*!< 0x00000080 */
#define USB_DADDR_EF      USB_DADDR_EF_Msk              /*!< EF (Enable function) */

