zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba25xx.h
/********************  Bit definition for USB_LPMCSR register  ********************/
#define USB_LPMCSR_LPMEN_Pos   (0UL)
#define USB_LPMCSR_LPMEN_Msk   (0x1UL << USB_LPMCSR_LPMEN_Pos)   /*!< 0x00000001 */
#define USB_LPMCSR_LPMEN       USB_LPMCSR_LPMEN_Msk              /*!< LPMEN (LPM support enable) */
#define USB_LPMCSR_LPMACK_Pos  (1UL)
#define USB_LPMCSR_LPMACK_Msk  (0x1UL << USB_LPMCSR_LPMACK_Pos)  /*!< 0x00000002 */
#define USB_LPMCSR_LPMACK      USB_LPMCSR_LPMACK_Msk             /*!< LPMACK (LPM token acknowledge enable) */
#define USB_LPMCSR_REMWAKE_Pos (3UL)
#define USB_LPMCSR_REMWAKE_Msk (0x1UL << USB_LPMCSR_REMWAKE_Pos) /*!< 0x00000008 */
#define USB_LPMCSR_REMWAKE     USB_LPMCSR_REMWAKE_Msk            /*!< REMWAKE (bRemoteWake value) */
#define USB_LPMCSR_BESL_Pos    (4UL)
#define USB_LPMCSR_BESL_Msk    (0xFUL << USB_LPMCSR_BESL_Pos)    /*!< 0x000000F0 */
#define USB_LPMCSR_BESL        USB_LPMCSR_BESL_Msk               /*!< BESL[3:0] bits (BESL value) */
#define USB_LPMCSR_BESL_0      (0x01UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000010 */
#define USB_LPMCSR_BESL_1      (0x02UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000020 */
#define USB_LPMCSR_BESL_2      (0x04UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000040 */
#define USB_LPMCSR_BESL_3      (0x08UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000080 */

/********************  Bit definition for USB_BCDR register  ********************/
#define USB_BCDR_BCDEN_Pos    (0UL)
#define USB_BCDR_BCDEN_Msk    (0x1UL << USB_BCDR_BCDEN_Pos)    /*!< 0x00000001 */
#define USB_BCDR_BCDEN        USB_BCDR_BCDEN_Msk               /*!< BCDEN (Battery charging detector (BCD) enable) */
#define USB_BCDR_PDEN_Pos     (2UL)
#define USB_BCDR_PDEN_Msk     (0x1UL << USB_BCDR_PDEN_Pos)     /*!< 0x00000004 */
#define USB_BCDR_PDEN         USB_BCDR_PDEN_Msk                /*!< PDEN (Primary detection (PD) mode enable) */
#define USB_BCDR_SDEN_Pos     (3UL)
#define USB_BCDR_SDEN_Msk     (0x1UL << USB_BCDR_SDEN_Pos)     /*!< 0x00000008 */
#define USB_BCDR_SDEN         USB_BCDR_SDEN_Msk                /*!< SDEN (Secondary detection (SD) mode enable) */
#define USB_BCDR_PDET_Pos     (5UL)
#define USB_BCDR_PDET_Msk     (0x1UL << USB_BCDR_PDET_Pos)     /*!< 0x00000020 */
#define USB_BCDR_PDET         USB_BCDR_PDET_Msk                /*!< PDET (Primary detection (PD) status) */
#define USB_BCDR_SDET_Pos     (6UL)
#define USB_BCDR_SDET_Msk     (0x1UL << USB_BCDR_SDET_Pos)     /*!< 0x00000040 */
#define USB_BCDR_SDET         USB_BCDR_SDET_Msk                /*!< SDET (Secondary detection (SD) status) */
#define USB_BCDR_PS2DET_Pos   (7UL)
#define USB_BCDR_PS2DET_Msk   (0x1UL << USB_BCDR_PS2DET_Pos)   /*!< 0x00000080 */
#define USB_BCDR_PS2DET       USB_BCDR_PS2DET_Msk              /*!< PS2DET (DM pull-up detection status) */
#define USB_BCDR_DPPU_DPD_Pos (15UL)
#define USB_BCDR_DPPU_DPD_Msk (0x1UL << USB_BCDR_DPPU_DPD_Pos) /*!< 0x00008000 */
#define USB_BCDR_DPPU_DPD     USB_BCDR_DPPU_DPD_Msk            /*!< DPPU_DPD (DP pull-up / DPDM pull-down) */

/********************  Bit definition for USB_CHEP_TXRXBD_n registers  ********************/
#define USB_CHEP_TXRXBD_ADDR_TX_Pos   (0UL)
#define USB_CHEP_TXRXBD_ADDR_TX_Msk   (0xFFFFUL << USB_CHEP_TXRXBD_ADDR_TX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_TXRXBD_ADDR_TX       USB_CHEP_TXRXBD_ADDR_TX_Msk               /*!< ADDR_TX[15:0] bits (Transmission buffer address) */
#define USB_CHEP_TXRXBD_COUNT_TX_Pos  (16UL)
#define USB_CHEP_TXRXBD_COUNT_TX_Msk  (0x3FFUL << USB_CHEP_TXRXBD_COUNT_TX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_TXRXBD_COUNT_TX      USB_CHEP_TXRXBD_COUNT_TX_Msk              /*!< COUNT_TX[9:0] bits (Transmission byte count) */
#define USB_CHEP_TXRXBD_ADDR_RX_Pos   (0UL)
#define USB_CHEP_TXRXBD_ADDR_RX_Msk   (0xFFFFUL << USB_CHEP_TXRXBD_ADDR_RX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_TXRXBD_ADDR_RX       USB_CHEP_TXRXBD_ADDR_RX_Msk               /*!< ADDR_RX[15:0] bits (Reception buffer address) */
#define USB_CHEP_TXRXBD_COUNT_RX_Pos  (16UL)
#define USB_CHEP_TXRXBD_COUNT_RX_Msk  (0x3FFUL << USB_CHEP_TXRXBD_COUNT_RX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_TXRXBD_COUNT_RX      USB_CHEP_TXRXBD_COUNT_RX_Msk              /*!< COUNT_RX[9:0] bits (Reception byte count) */
#define USB_CHEP_TXRXBD_NUM_BLOCK_Pos (26UL)
#define USB_CHEP_TXRXBD_NUM_BLOCK_Msk (0x1FUL << USB_CHEP_TXRXBD_NUM_BLOCK_Pos) /*!< 0x7C000000 */
#define USB_CHEP_TXRXBD_NUM_BLOCK     USB_CHEP_TXRXBD_NUM_BLOCK_Msk             /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define USB_CHEP_TXRXBD_BLSIZE_Pos    (31UL)
#define USB_CHEP_TXRXBD_BLSIZE_Msk    (0x1UL << USB_CHEP_TXRXBD_BLSIZE_Pos)     /*!< 0x80000000 */
#define USB_CHEP_TXRXBD_BLSIZE        USB_CHEP_TXRXBD_BLSIZE_Msk                /*!< BLSIZE (Block size) */

/********************  Bit definition for USB_CHEP_RXTXBD_n registers  ********************/
#define USB_CHEP_RXTXBD_ADDR_RX_Pos   (0UL)
#define USB_CHEP_RXTXBD_ADDR_RX_Msk   (0xFFFFUL << USB_CHEP_RXTXBD_ADDR_RX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_RXTXBD_ADDR_RX       USB_CHEP_RXTXBD_ADDR_RX_Msk               /*!< ADDR_RX[15:0] bits (Reception buffer address) */
#define USB_CHEP_RXTXBD_COUNT_RX_Pos  (16UL)
#define USB_CHEP_RXTXBD_COUNT_RX_Msk  (0x3FFUL << USB_CHEP_RXTXBD_COUNT_RX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_RXTXBD_COUNT_RX      USB_CHEP_RXTXBD_COUNT_RX_Msk              /*!< COUNT_RX[9:0] bits (Reception byte count) */
#define USB_CHEP_RXTXBD_NUM_BLOCK_Pos (26UL)
#define USB_CHEP_RXTXBD_NUM_BLOCK_Msk (0x1FUL << USB_CHEP_RXTXBD_NUM_BLOCK_Pos) /*!< 0x7C000000 */
#define USB_CHEP_RXTXBD_NUM_BLOCK     USB_CHEP_RXTXBD_NUM_BLOCK_Msk             /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define USB_CHEP_RXTXBD_BLSIZE_Pos    (31UL)
#define USB_CHEP_RXTXBD_BLSIZE_Msk    (0x1UL << USB_CHEP_RXTXBD_BLSIZE_Pos)     /*!< 0x80000000 */
#define USB_CHEP_RXTXBD_BLSIZE        USB_CHEP_RXTXBD_BLSIZE_Msk                /*!< BLSIZE (Block size) */
#define USB_CHEP_RXTXBD_ADDR_TX_Pos   (0UL)
#define USB_CHEP_RXTXBD_ADDR_TX_Msk   (0xFFFFUL << USB_CHEP_RXTXBD_ADDR_TX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_RXTXBD_ADDR_TX       USB_CHEP_RXTXBD_ADDR_TX_Msk               /*!< ADDR_TX[15:0] bits (Transmission buffer address) */
#define USB_CHEP_RXTXBD_COUNT_TX_Pos  (16UL)
#define USB_CHEP_RXTXBD_COUNT_TX_Msk  (0x3FFUL << USB_CHEP_RXTXBD_COUNT_TX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_RXTXBD_COUNT_TX      USB_CHEP_RXTXBD_COUNT_TX_Msk              /*!< COUNT_TX[9:0] bits (Transmission byte count) */

