zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba25xx.h
/*!< STAT_RX[1:0] STATus for RX transfer */
#define USB_EP_RX_DIS                              (0x00000000UL)           /*!< EndPoint RX Disabled */
#define USB_EP_RX_STALL                            (0x00001000UL)           /*!< EndPoint RX STALLed */
#define USB_EP_RX_NAK                              (0x00002000UL)           /*!< EndPoint RX NAKed */
#define USB_EP_RX_VALID                            (0x00003000UL)           /*!< EndPoint RX VALID */

#define USB_EP_RX_ACK_SBUF                         (0x00000000UL)           /*!< ACK single buffer mode */
#define USB_EP_RX_ACK_DBUF                         (0x00003000UL)           /*!< ACK Double buffer mode */

#define USB_CH_RX_DIS                              (0x00000000UL)           /*!< EndPoint RX Disabled */
#define USB_CH_RX_STALL                            (0x00001000UL)           /*!< EndPoint RX STALLed */
#define USB_CH_RX_NAK                              (0x00002000UL)           /*!< Channel RX NAKed */
#define USB_CH_RX_VALID                            (0x00003000UL)           /*!< Channel RX VALID */

#define USB_CH_RX_ACK_SBUF                         (0x00000000UL)           /*!< ACK single buffer mode */
#define USB_CH_RX_ACK_DBUF                         (0x00003000UL)           /*!< ACK Double buffer mode */

/*! <used For Double Buffer Enable Disable */
#define USB_CHEP_DB_MSK                            (0xFFFF0F0FUL)

/*Buffer Descriptor Mask*/
#define USB_PMA_TXBD_ADDMSK                        (0xFFFF0000UL)
#define USB_PMA_TXBD_COUNTMSK                      (0x0000FFFFUL)
#define USB_PMA_RXBD_ADDMSK                        (0xFFFF0000UL)
#define USB_PMA_RXBD_COUNTMSK                      (0x03FFFFFFUL)

/*!< USB PMA SIZE */
#define USB_DRD_PMA_SIZE                                  (2048U)           /*!< USB PMA Size 2Kbyte */

#define USB_DRD_FS_EP_NBR                                    (8U)           /*!< Number of USB Device endpoints */
#define USB_DRD_FS_CH_NBR                                    (8U)           /*!< Number of USB Host channels */

/******************************************************************************/
/*                                                                            */
/*                        XSPI register block                                 */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for XSPI_CR register  ********************/
#define XSPI_CR_EN_Pos     (0UL)
#define XSPI_CR_EN_Msk     (0x1UL << XSPI_CR_EN_Pos)      /*!< 0x00000001 */
#define XSPI_CR_EN         XSPI_CR_EN_Msk                 /*!< EN (Enable) */
#define XSPI_CR_ABORT_Pos  (1UL)
#define XSPI_CR_ABORT_Msk  (0x1UL << XSPI_CR_ABORT_Pos)   /*!< 0x00000002 */
#define XSPI_CR_ABORT      XSPI_CR_ABORT_Msk              /*!< ABORT (Abort request) */
#define XSPI_CR_DMAEN_Pos  (2UL)
#define XSPI_CR_DMAEN_Msk  (0x1UL << XSPI_CR_DMAEN_Pos)   /*!< 0x00000004 */
#define XSPI_CR_DMAEN      XSPI_CR_DMAEN_Msk              /*!< DMAEN (DMA enable) */
#define XSPI_CR_TCEN_Pos   (3UL)
#define XSPI_CR_TCEN_Msk   (0x1UL << XSPI_CR_TCEN_Pos)    /*!< 0x00000008 */
#define XSPI_CR_TCEN       XSPI_CR_TCEN_Msk               /*!< TCEN (Timeout counter enable) */
#define XSPI_CR_DMM_Pos    (6UL)
#define XSPI_CR_DMM_Msk    (0x1UL << XSPI_CR_DMM_Pos)     /*!< 0x00000040 */
#define XSPI_CR_DMM        XSPI_CR_DMM_Msk                /*!< DMM (Dual-memory configuration) */
#define XSPI_CR_FTHRES_Pos (8UL)
#define XSPI_CR_FTHRES_Msk (0x1FUL << XSPI_CR_FTHRES_Pos) /*!< 0x00001F00 */
#define XSPI_CR_FTHRES     XSPI_CR_FTHRES_Msk             /*!< FTHRES[4:0] bits (FIFO threshold level) */
#define XSPI_CR_TEIE_Pos   (16UL)
#define XSPI_CR_TEIE_Msk   (0x1UL << XSPI_CR_TEIE_Pos)    /*!< 0x00010000 */
#define XSPI_CR_TEIE       XSPI_CR_TEIE_Msk               /*!< TEIE (Transfer error interrupt enable) */
#define XSPI_CR_TCIE_Pos   (17UL)
#define XSPI_CR_TCIE_Msk   (0x1UL << XSPI_CR_TCIE_Pos)    /*!< 0x00020000 */
#define XSPI_CR_TCIE       XSPI_CR_TCIE_Msk               /*!< TCIE (Transfer complete interrupt enable) */
#define XSPI_CR_FTIE_Pos   (18UL)
#define XSPI_CR_FTIE_Msk   (0x1UL << XSPI_CR_FTIE_Pos)    /*!< 0x00040000 */
#define XSPI_CR_FTIE       XSPI_CR_FTIE_Msk               /*!< FTIE (FIFO threshold interrupt enable) */
#define XSPI_CR_TOIE_Pos   (20UL)
#define XSPI_CR_TOIE_Msk   (0x1UL << XSPI_CR_TOIE_Pos)    /*!< 0x00100000 */
#define XSPI_CR_TOIE       XSPI_CR_TOIE_Msk               /*!< TOIE (Timeout interrupt enable) */
#define XSPI_CR_CSSEL_Pos  (24UL)
#define XSPI_CR_CSSEL_Msk  (0x1UL << XSPI_CR_CSSEL_Pos)   /*!< 0x01000000 */
#define XSPI_CR_CSSEL      XSPI_CR_CSSEL_Msk              /*!< Chip Select Selection */
#define XSPI_CR_NOPREF_Pos (25UL)
#define XSPI_CR_NOPREF_Msk (0x1UL << XSPI_CR_NOPREF_Pos)  /*!< 0x02000000 */
#define XSPI_CR_NOPREF     XSPI_CR_NOPREF_Msk             /*!< No Prefetch Data */
#define XSPI_CR_FMODE_Pos  (28UL)
#define XSPI_CR_FMODE_Msk  (0x3UL << XSPI_CR_FMODE_Pos)   /*!< 0x30000000 */
#define XSPI_CR_FMODE      XSPI_CR_FMODE_Msk              /*!< FMODE[1:0] bits (Functional mode) */
#define XSPI_CR_FMODE_0    (0x1UL << XSPI_CR_FMODE_Pos)   /*!< 0x10000000 */
#define XSPI_CR_FMODE_1    (0x2UL << XSPI_CR_FMODE_Pos)   /*!< 0x20000000 */
#define XSPI_CR_MSEL_Pos   (30UL)
#define XSPI_CR_MSEL_Msk   (0x1UL << XSPI_CR_MSEL_Pos)    /*!< 0x40000000 */
#define XSPI_CR_MSEL       XSPI_CR_MSEL_Msk               /*!< Flash Select */

/********************  Bit definition for XSPI_DCR1 register  ********************/
#define XSPI_DCR1_CKMODE_Pos  (0UL)
#define XSPI_DCR1_CKMODE_Msk  (0x1UL << XSPI_DCR1_CKMODE_Pos)   /*!< 0x00000001 */
#define XSPI_DCR1_CKMODE      XSPI_DCR1_CKMODE_Msk              /*!< CKMODE (Clock mode 0/mode 3) */
#define XSPI_DCR1_FRCK_Pos    (1UL)
#define XSPI_DCR1_FRCK_Msk    (0x1UL << XSPI_DCR1_FRCK_Pos)     /*!< 0x00000002 */
#define XSPI_DCR1_FRCK        XSPI_DCR1_FRCK_Msk                /*!< FRCK (Free running clock) */
#define XSPI_DCR1_DLYBYP_Pos  (3UL)
#define XSPI_DCR1_DLYBYP_Msk  (0x1UL << XSPI_DCR1_DLYBYP_Pos)   /*!< 0x00000008 */
#define XSPI_DCR1_DLYBYP      XSPI_DCR1_DLYBYP_Msk              /*!< DLYBYP (Delay block bypass) */
#define XSPI_DCR1_CSHT_Pos    (8UL)
#define XSPI_DCR1_CSHT_Msk    (0x3FUL << XSPI_DCR1_CSHT_Pos)    /*!< 0x00003F00 */
#define XSPI_DCR1_CSHT        XSPI_DCR1_CSHT_Msk                /*!< CSHT[5:0] bits (Chip-select high time) */
#define XSPI_DCR1_DEVSIZE_Pos (16UL)
#define XSPI_DCR1_DEVSIZE_Msk (0x1FUL << XSPI_DCR1_DEVSIZE_Pos) /*!< 0x001F0000 */
#define XSPI_DCR1_DEVSIZE     XSPI_DCR1_DEVSIZE_Msk             /*!< DEVSIZE[4:0] bits (Device size) */
#define XSPI_DCR1_MTYP_Pos    (24UL)
#define XSPI_DCR1_MTYP_Msk    (0x7UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x07000000 */
#define XSPI_DCR1_MTYP        XSPI_DCR1_MTYP_Msk                /*!< MTYP[2:0] bits (Memory type) */
#define XSPI_DCR1_MTYP_0      (0x1UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x01000000 */
#define XSPI_DCR1_MTYP_1      (0x2UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x02000000 */
#define XSPI_DCR1_MTYP_2      (0x4UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x04000000 */

