zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba25xx.h
/********************  Bit definition for XSPI_DCR2 register  ********************/
#define XSPI_DCR2_PRESCALER_Pos (0UL)
#define XSPI_DCR2_PRESCALER_Msk (0xFFUL << XSPI_DCR2_PRESCALER_Pos)  /*!< 0x000000FF */
#define XSPI_DCR2_PRESCALER     XSPI_DCR2_PRESCALER_Msk              /*!< PRESCALER[7:0] bits (Clock prescaler) */

/********************  Bit definition for XSPI_SR register  ********************/
#define XSPI_SR_TEF_Pos    (0UL)
#define XSPI_SR_TEF_Msk    (0x1UL << XSPI_SR_TEF_Pos)     /*!< 0x00000001 */
#define XSPI_SR_TEF        XSPI_SR_TEF_Msk                /*!< TEF (Transfer error flag) */
#define XSPI_SR_TCF_Pos    (1UL)
#define XSPI_SR_TCF_Msk    (0x1UL << XSPI_SR_TCF_Pos)     /*!< 0x00000002 */
#define XSPI_SR_TCF        XSPI_SR_TCF_Msk                /*!< TCF (Transfer complete flag) */
#define XSPI_SR_FTF_Pos    (2UL)
#define XSPI_SR_FTF_Msk    (0x1UL << XSPI_SR_FTF_Pos)     /*!< 0x00000004 */
#define XSPI_SR_FTF        XSPI_SR_FTF_Msk                /*!< FTF (FIFO threshold flag) */
#define XSPI_SR_TOF_Pos    (4UL)
#define XSPI_SR_TOF_Msk    (0x1UL << XSPI_SR_TOF_Pos)     /*!< 0x00000010 */
#define XSPI_SR_TOF        XSPI_SR_TOF_Msk                /*!< TOF (Timeout flag) */
#define XSPI_SR_BUSY_Pos   (5UL)
#define XSPI_SR_BUSY_Msk   (0x1UL << XSPI_SR_BUSY_Pos)    /*!< 0x00000020 */
#define XSPI_SR_BUSY       XSPI_SR_BUSY_Msk               /*!< BUSY (Busy) */
#define XSPI_SR_FLEVEL_Pos (8UL)
#define XSPI_SR_FLEVEL_Msk (0x3FUL << XSPI_SR_FLEVEL_Pos) /*!< 0x00003F00 */
#define XSPI_SR_FLEVEL     XSPI_SR_FLEVEL_Msk             /*!< FLEVEL[5:0] bits (FIFO level) */

/********************  Bit definition for XSPI_FCR register  ********************/
#define XSPI_FCR_CTEF_Pos (0UL)
#define XSPI_FCR_CTEF_Msk (0x1UL << XSPI_FCR_CTEF_Pos) /*!< 0x00000001 */
#define XSPI_FCR_CTEF     XSPI_FCR_CTEF_Msk            /*!< CTEF (Clear transfer error flag) */
#define XSPI_FCR_CTCF_Pos (1UL)
#define XSPI_FCR_CTCF_Msk (0x1UL << XSPI_FCR_CTCF_Pos) /*!< 0x00000002 */
#define XSPI_FCR_CTCF     XSPI_FCR_CTCF_Msk            /*!< CTCF (Clear transfer complete flag) */
#define XSPI_FCR_CTOF_Pos (4UL)
#define XSPI_FCR_CTOF_Msk (0x1UL << XSPI_FCR_CTOF_Pos) /*!< 0x00000010 */
#define XSPI_FCR_CTOF     XSPI_FCR_CTOF_Msk            /*!< CTOF (Clear timeout flag) */

/********************  Bit definition for XSPI_DLR register  ********************/
#define XSPI_DLR_DL_Pos (0UL)
#define XSPI_DLR_DL_Msk (0xFFFFFFFFUL << XSPI_DLR_DL_Pos) /*!< 0xFFFFFFFF */
#define XSPI_DLR_DL     XSPI_DLR_DL_Msk                   /*!< DL[31:0] bits (Data length) */

/********************  Bit definition for XSPI_AR register  ********************/
#define XSPI_AR_ADDRESS_Pos (0UL)
#define XSPI_AR_ADDRESS_Msk (0xFFFFFFFFUL << XSPI_AR_ADDRESS_Pos) /*!< 0xFFFFFFFF */
#define XSPI_AR_ADDRESS     XSPI_AR_ADDRESS_Msk                   /*!< ADDRESS[31:0] bits (Address) */

/********************  Bit definition for XSPI_DR register  ********************/
#define XSPI_DR_DATA_Pos (0UL)
#define XSPI_DR_DATA_Msk (0xFFFFFFFFUL << XSPI_DR_DATA_Pos) /*!< 0xFFFFFFFF */
#define XSPI_DR_DATA     XSPI_DR_DATA_Msk                   /*!< DATA[31:0] bits (Data) */

/********************  Bit definition for XSPI_CCR register  ********************/
#define XSPI_CCR_IMODE_Pos  (0UL)
#define XSPI_CCR_IMODE_Msk  (0x7UL << XSPI_CCR_IMODE_Pos)  /*!< 0x00000007 */
#define XSPI_CCR_IMODE      XSPI_CCR_IMODE_Msk             /*!< IMODE[2:0] bits (Instruction mode) */
#define XSPI_CCR_IMODE_0    (0x1UL << XSPI_CCR_IMODE_Pos)  /*!< 0x00000001 */
#define XSPI_CCR_IMODE_1    (0x2UL << XSPI_CCR_IMODE_Pos)  /*!< 0x00000002 */
#define XSPI_CCR_IMODE_2    (0x4UL << XSPI_CCR_IMODE_Pos)  /*!< 0x00000004 */
#define XSPI_CCR_IDTR_Pos   (3UL)
#define XSPI_CCR_IDTR_Msk   (0x1UL << XSPI_CCR_IDTR_Pos)   /*!< 0x00000008 */
#define XSPI_CCR_IDTR       XSPI_CCR_IDTR_Msk              /*!< IDTR (Instruction double transfer rate) */
#define XSPI_CCR_ISIZE_Pos  (4UL)
#define XSPI_CCR_ISIZE_Msk  (0x3UL << XSPI_CCR_ISIZE_Pos)  /*!< 0x00000030 */
#define XSPI_CCR_ISIZE      XSPI_CCR_ISIZE_Msk             /*!< ISIZE[1:0] bits (Instruction size) */
#define XSPI_CCR_ISIZE_0    (0x1UL << XSPI_CCR_ISIZE_Pos)  /*!< 0x00000010 */
#define XSPI_CCR_ISIZE_1    (0x2UL << XSPI_CCR_ISIZE_Pos)  /*!< 0x00000020 */
#define XSPI_CCR_ADMODE_Pos (8UL)
#define XSPI_CCR_ADMODE_Msk (0x7UL << XSPI_CCR_ADMODE_Pos) /*!< 0x00000700 */
#define XSPI_CCR_ADMODE     XSPI_CCR_ADMODE_Msk            /*!< ADMODE[2:0] bits (Address mode) */
#define XSPI_CCR_ADMODE_0   (0x1UL << XSPI_CCR_ADMODE_Pos) /*!< 0x00000100 */
#define XSPI_CCR_ADMODE_1   (0x2UL << XSPI_CCR_ADMODE_Pos) /*!< 0x00000200 */
#define XSPI_CCR_ADMODE_2   (0x4UL << XSPI_CCR_ADMODE_Pos) /*!< 0x00000400 */
#define XSPI_CCR_ADDTR_Pos  (11UL)
#define XSPI_CCR_ADDTR_Msk  (0x1UL << XSPI_CCR_ADDTR_Pos)  /*!< 0x00000800 */
#define XSPI_CCR_ADDTR      XSPI_CCR_ADDTR_Msk             /*!< ADDTR (Address double transfer rate) */
#define XSPI_CCR_ADSIZE_Pos (12UL)
#define XSPI_CCR_ADSIZE_Msk (0x3UL << XSPI_CCR_ADSIZE_Pos) /*!< 0x00003000 */
#define XSPI_CCR_ADSIZE     XSPI_CCR_ADSIZE_Msk            /*!< ADSIZE[1:0] bits (Address size) */
#define XSPI_CCR_ADSIZE_0   (0x1UL << XSPI_CCR_ADSIZE_Pos) /*!< 0x00001000 */
#define XSPI_CCR_ADSIZE_1   (0x2UL << XSPI_CCR_ADSIZE_Pos) /*!< 0x00002000 */
#define XSPI_CCR_ABMODE_Pos (16UL)
#define XSPI_CCR_ABMODE_Msk (0x7UL << XSPI_CCR_ABMODE_Pos) /*!< 0x00070000 */
#define XSPI_CCR_ABMODE     XSPI_CCR_ABMODE_Msk            /*!< ABMODE[2:0] bits (Alternate-byte mode) */
#define XSPI_CCR_ABMODE_0   (0x1UL << XSPI_CCR_ABMODE_Pos) /*!< 0x00010000 */
#define XSPI_CCR_ABMODE_1   (0x2UL << XSPI_CCR_ABMODE_Pos) /*!< 0x00020000 */
#define XSPI_CCR_ABMODE_2   (0x4UL << XSPI_CCR_ABMODE_Pos) /*!< 0x00040000 */
#define XSPI_CCR_ABDTR_Pos  (19UL)
#define XSPI_CCR_ABDTR_Msk  (0x1UL << XSPI_CCR_ABDTR_Pos)  /*!< 0x00080000 */
#define XSPI_CCR_ABDTR      XSPI_CCR_ABDTR_Msk             /*!< ABDTR (Alternate- byte double transfer rate) */
#define XSPI_CCR_ABSIZE_Pos (20UL)
#define XSPI_CCR_ABSIZE_Msk (0x3UL << XSPI_CCR_ABSIZE_Pos) /*!< 0x00300000 */
#define XSPI_CCR_ABSIZE     XSPI_CCR_ABSIZE_Msk            /*!< ABSIZE[1:0] bits (Alternate-byte size) */
#define XSPI_CCR_ABSIZE_0   (0x1UL << XSPI_CCR_ABSIZE_Pos) /*!< 0x00100000 */
#define XSPI_CCR_ABSIZE_1   (0x2UL << XSPI_CCR_ABSIZE_Pos) /*!< 0x00200000 */
#define XSPI_CCR_DMODE_Pos  (24UL)
#define XSPI_CCR_DMODE_Msk  (0x7UL << XSPI_CCR_DMODE_Pos)  /*!< 0x07000000 */
#define XSPI_CCR_DMODE      XSPI_CCR_DMODE_Msk             /*!< DMODE[2:0] bits (Data mode) */
#define XSPI_CCR_DMODE_0    (0x1UL << XSPI_CCR_DMODE_Pos)  /*!< 0x01000000 */
#define XSPI_CCR_DMODE_1    (0x2UL << XSPI_CCR_DMODE_Pos)  /*!< 0x02000000 */
#define XSPI_CCR_DMODE_2    (0x4UL << XSPI_CCR_DMODE_Pos)  /*!< 0x04000000 */
#define XSPI_CCR_DDTR_Pos   (27UL)
#define XSPI_CCR_DDTR_Msk   (0x1UL << XSPI_CCR_DDTR_Pos)   /*!< 0x08000000 */
#define XSPI_CCR_DDTR       XSPI_CCR_DDTR_Msk              /*!< DDTR (Data double transfer rate) */
#define XSPI_CCR_DQSE_Pos   (29UL)
#define XSPI_CCR_DQSE_Msk   (0x1UL << XSPI_CCR_DQSE_Pos)   /*!< 0x20000000 */
#define XSPI_CCR_DQSE       XSPI_CCR_DQSE_Msk              /*!< DQSE (DQS enable) */

/********************  Bit definition for XSPI_TCR register  ********************/
#define XSPI_TCR_DCYC_Pos   (0UL)
#define XSPI_TCR_DCYC_Msk   (0x1FUL << XSPI_TCR_DCYC_Pos)  /*!< 0x0000001F */
#define XSPI_TCR_DCYC       XSPI_TCR_DCYC_Msk              /*!< DCYC[4:0] bits (Number of dummy cycles) */
#define XSPI_TCR_DCYC_0     (0x01UL << XSPI_TCR_DCYC_Pos)  /*!< 0x00000001 */
#define XSPI_TCR_DCYC_1     (0x02UL << XSPI_TCR_DCYC_Pos)  /*!< 0x00000002 */
#define XSPI_TCR_DCYC_2     (0x04UL << XSPI_TCR_DCYC_Pos)  /*!< 0x00000004 */
#define XSPI_TCR_DCYC_3     (0x08UL << XSPI_TCR_DCYC_Pos)  /*!< 0x00000008 */
#define XSPI_TCR_DCYC_4     (0x10UL << XSPI_TCR_DCYC_Pos)  /*!< 0x00000010 */
#define XSPI_TCR_DHQC_Pos   (28UL)
#define XSPI_TCR_DHQC_Msk   (0x1UL << XSPI_TCR_DHQC_Pos)   /*!< 0x10000000 */
#define XSPI_TCR_DHQC       XSPI_TCR_DHQC_Msk              /*!< DHQC (Delay hold quarter cycle) */
#define XSPI_TCR_SSHIFT_Pos (30UL)
#define XSPI_TCR_SSHIFT_Msk (0x1UL << XSPI_TCR_SSHIFT_Pos) /*!< 0x40000000 */
#define XSPI_TCR_SSHIFT     XSPI_TCR_SSHIFT_Msk            /*!< SSHIFT (Sample shift) */

/********************  Bit definition for XSPI_IR register  ********************/
#define XSPI_IR_INSTRUCTION_Pos (0UL)
#define XSPI_IR_INSTRUCTION_Msk (0xFFFFFFFFUL << XSPI_IR_INSTRUCTION_Pos) /*!< 0xFFFFFFFF */
#define XSPI_IR_INSTRUCTION     XSPI_IR_INSTRUCTION_Msk                   /*!< INSTRUCTION[31:0] bits (Instruction) */

/********************  Bit definition for XSPI_ABR register  ********************/
#define XSPI_ABR_ALTERNATE_Pos (0UL)
#define XSPI_ABR_ALTERNATE_Msk (0xFFFFFFFFUL << XSPI_ABR_ALTERNATE_Pos) /*!< 0xFFFFFFFF */
#define XSPI_ABR_ALTERNATE     XSPI_ABR_ALTERNATE_Msk                   /*!< ALTERNATE[31:0] bits (Alternate bytes) */

/********************  Bit definition for XSPI_LPTR register  ********************/
#define XSPI_LPTR_TIMEOUT_Pos (0UL)
#define XSPI_LPTR_TIMEOUT_Msk (0xFFFFUL << XSPI_LPTR_TIMEOUT_Pos) /*!< 0x0000FFFF */
#define XSPI_LPTR_TIMEOUT XSPI_LPTR_TIMEOUT_Msk /*!< TIMEOUT[15:0] bits (Timeout period) */
/** @} */

/** @} */

/** @addtogroup STM32WBAxx_Peripheral_Exported_macros
  * @{
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* Instances allowed from Secure state */
/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC4_NS) || \
                                       ((INSTANCE) == ADC4_S))

#define IS_ADC_COMMON_INSTANCE(INSTANCE) (((INSTANCE) == ADC4_COMMON_NS) || \
                                          ((INSTANCE) == ADC4_COMMON_S))

/******************************* AES Instances ********************************/
#define IS_AES_ALL_INSTANCE(INSTANCE) (((INSTANCE) == AES_NS) || ((INSTANCE) == AES_S))

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CRC_NS) || ((INSTANCE) == CRC_S))

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == LPDMA1_Channel0_NS)  || ((INSTANCE) == LPDMA1_Channel0_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel1_NS)  || ((INSTANCE) == LPDMA1_Channel1_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel2_NS)  || ((INSTANCE) == LPDMA1_Channel2_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel3_NS)  || ((INSTANCE) == LPDMA1_Channel3_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel4_NS)  || ((INSTANCE) == LPDMA1_Channel4_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel5_NS)  || ((INSTANCE) == LPDMA1_Channel5_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel6_NS)  || ((INSTANCE) == LPDMA1_Channel6_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel7_NS)  || ((INSTANCE) == LPDMA1_Channel7_S))

#define IS_LPDMA_INSTANCE(INSTANCE)   (((INSTANCE) == LPDMA1_Channel0_NS)  || ((INSTANCE) == LPDMA1_Channel0_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel1_NS)  || ((INSTANCE) == LPDMA1_Channel1_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel2_NS)  || ((INSTANCE) == LPDMA1_Channel2_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel3_NS)  || ((INSTANCE) == LPDMA1_Channel3_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel4_NS)  || ((INSTANCE) == LPDMA1_Channel4_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel5_NS)  || ((INSTANCE) == LPDMA1_Channel5_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel6_NS)  || ((INSTANCE) == LPDMA1_Channel6_S)  || \
                                       ((INSTANCE) == LPDMA1_Channel7_NS)  || ((INSTANCE) == LPDMA1_Channel7_S))

